_posts/productivity/2019-03-31-emacs-offlineimap-mu4e-mail-client.html
---
layout: post
title: 在 Emacs 中用 mu4e 和 offlineimap 查看 O365 Exchange 邮件
categories: [productivity]
tags: [emacs]
---

<p>
为了能在 Emacs 中收发邮件，来来回回折腾了不少时间。终于搞定了。现将配置过程梳理如下。
</p>

<div id="outline-container-org3040565" class="outline-2">
<h2 id="org3040565"><span class="section-number-2">1</span> 检查系统环境</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1d0162e" class="outline-3">
<h3 id="org1d0162e"><span class="section-number-3">1.1</span> 软件版本</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>macOS 10.14.3 (18D109)</li>
<li>GNU Emacs 26.1 (build 1, x86_64-apple-darwin14.5.0, NS appkit-1348.17 Version 10.10.5 (Build 14F2511)) of 2018-05-31</li>
<li>mu (mail indexer/searcher) version 1.0</li>
<li>offlineimap v7.2.1, imaplib2 v2.57 (bundled), Python v2.7.10, LibreSSL 2.2.7</li>
</ol>
</div>
</div>

<div id="outline-container-orgc09e4fe" class="outline-3">
<h3 id="orgc09e4fe"><span class="section-number-3">1.2</span> 邮件系统</h3>
<div class="outline-text-3" id="text-1-2">
<p>
世纪互联运营的 Office 365
</p>
<ul class="org-ul">
<li>服务器名称: partner.outlook.cn</li>
<li>端口: 993</li>
<li>加密方法: TLS</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org510ed21" class="outline-2">
<h2 id="org510ed21"><span class="section-number-2">2</span> 安装 mu 和 offlineimap</h2>
<div class="outline-text-2" id="text-2">
<p>
安装 mu：
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install mu
</pre>
</div>

<p>
安装 offlineimap
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install offlineimap
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd057d17" class="outline-2">
<h2 id="orgd057d17"><span class="section-number-2">3</span> 配置 offlineimap</h2>
<div class="outline-text-2" id="text-3">
<p>
在 HOME path 下创建 <code>.offlineimaprc</code>, 内容如下：
</p>

<div class="org-src-container">
<pre class="src src-shell">[general]
accounts = outlook
maxsyncaccounts = 3
pythonfile = ~/.offlineimap.py

[Account outlook]
localrepository = outlook-Local
remoterepository = outlook-Remote
utf8foldernames = True

[Repository outlook-Local]
<span style="color: #000000;">type</span> = Maildir
localfolders = ~/.mail/outlook

[Repository outlook-Remote]
<span style="color: #000000;">type</span> = IMAP
remotehost = imap.partner.outlook.cn
remoteuser = &lt;your mail address&gt;
remotepass = &lt;your password&gt;
ssl = true
sslcacertfile = /etc/ssl/cert.pem
maxconnections = 4
realdelete = yes
</pre>
</div>

<p>
我看到网上不少文章说 offlineimap 不支持中文，但是查看 offlineimap 代码发现有
<code>utf8foldernames</code> 选项，设置成 True 即可支持 utf-8 了。因此也不需要 decode
imap4-utf-7 了。
</p>
</div>
</div>

<div id="outline-container-orge0c462b" class="outline-2">
<h2 id="orge0c462b"><span class="section-number-2">4</span> 同步邮件</h2>
<div class="outline-text-2" id="text-4">
<p>
执行以下命令：
</p>

<div class="org-src-container">
<pre class="src src-shell">offlineimap
</pre>
</div>

<p>
运行结果如下：
</p>

<div class="org-src-container">
<pre class="src src-shell">kimi.im:~$ offlineimap
OfflineIMAP 7.2.1
  Licensed under the GNU GPL v2 or any later version (with an OpenSSL exception)
imaplib2 v2.57 (bundled), Python v2.7.10, LibreSSL 2.2.7
Account sync outlook:
 *** Processing account outlook
 Establishing connection to imap.partner.outlook.cn:993 (outlook-Remote)
......
Account sync outlook:
 *** Finished account <span style="color: #3a5fcd;">'outlook'</span><span style="color: #8b008b; font-weight: bold;"> in</span> 5:11
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfadc2d7" class="outline-2">
<h2 id="orgfadc2d7"><span class="section-number-2">5</span> 用 mu 索引邮件</h2>
<div class="outline-text-2" id="text-5">
<p>
执行命令：
</p>

<div class="org-src-container">
<pre class="src src-shell">mu index -m ~/.mail
</pre>
</div>

<p>
运行结果如下：
</p>

<div class="org-src-container">
<pre class="src src-shell">kimi.im:~$ mu index -m ~/.mail
indexing messages under /Users/kimim/.mail [/Users/kimim/.mu/xapian]
/ processing mail; processed: 15750; updated/new: 0, cleaned-up: 0
cleaning up messages [/Users/kimim/.mu/xapian]
| processing mail; processed: 15814; updated/new: 0, cleaned-up: 0
elapsed: 0 second(s)
/ processing mail; processed: 15814; updated/new: 0, cleaned-up: 0
elapsed: 0 second(s)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga21cceb" class="outline-2">
<h2 id="orga21cceb"><span class="section-number-2">6</span> 配置 mu4e</h2>
<div class="outline-text-2" id="text-6">
<p>
在 Emacs 中增加 elisp
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #8b008b; font-weight: bold;">when</span> (eq system-type 'darwin)
  (add-to-list 'load-path <span style="color: #3a5fcd;">"/usr/local/Cellar/mu/1.0_1/share/emacs/site-lisp/mu/mu4e"</span>))

(<span style="color: #8b008b; font-weight: bold;">require</span> '<span style="color: #5f9ea0;">mu4e</span>)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mail-user-agent 'mu4e-user-agent)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-maildir <span style="color: #3a5fcd;">"~/.mail"</span>)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-get-mail-command <span style="color: #3a5fcd;">"offlineimap"</span>)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-update-interval 60)

(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-sent-folder   <span style="color: #3a5fcd;">"/wxciv/Sent Messages"</span>)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-drafts-folder <span style="color: #3a5fcd;">"/wxciv/Drafts"</span>)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-trash-folder  <span style="color: #3a5fcd;">"/wxciv/Deleted Messages"</span>)
(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-refile-folder  <span style="color: #3a5fcd;">"/wxciv/Archive"</span>)

(<span style="color: #8b008b; font-weight: bold;">setq</span> mu4e-view-show-images t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orged1a817" class="outline-2">
<h2 id="orged1a817"><span class="section-number-2">7</span> 大功告成</h2>
<div class="outline-text-2" id="text-7">
<p>
然后在 Emacs 中 <code>M-x mu4e</code> 即可查阅邮件了。
</p>
</div>
</div>
